<?php

/**
 *  我不认为应该重新发明轮子，
 *  但我认为应该在购买轮子前至少先了解轮子的制造过程。
 *
 * 虽然可选择的在线代码库很多，
 * 但最大的两家肯定是Bitbucket和GitHub。
 *
 * GitHub已经成为了存放开源软件的标准代码库。
 * 创业公司应该选择Bitbucket,
 * 因为它提供免费的私人代码库，
 * 而且只在开发团队达到一定规模后才收费。
 * 因为如果开发团队达到一定规模，
 * 那么他们要么获得了投资，
 * 要么产品开始赚钱了。
 *
 * 在GitHub上创建一个代码库
 * Create a new repository
 * public 公开不收费
 *
 * 当将文件推送到服务器时，
 * GitHub需要验证我们的身份，
 * 因此它需要我们的公钥。
 *
 * 生成公钥后，
 * 我们就可以通过GitHub的用户设置界面中的SSH and GPG keys 链接添加它。
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */

