<?php
/**
 *  php 类型声明
 *
 * 类型            起始版本                     说明
 * array            5.1                       数组，默认值可以是null或数组
 * int              7.0                       整数值，默认值可以是null或整数
 * float            7.0                       浮点数值。即使开启严格模式，也可以接受整数。默认值可以是null或整数、浮点类型
 * callable         5.4                       可调用代码（如匿名函数），默认值可以是null
 * bool             7.0                       布尔值，默认值可以是null或布尔值
 * string           5.0                       字符数据，默认值可以是null或字符串
 * self             5.0                       字符数据，指向自己的引用
 * 类类型           5.0                       类或接口类型，默认值可以是null
 *
 *
 *
 */
