<?php

/**
 *  从某种意义上说，遵守标准比标准的内容更加重要。
 *  遵守标准能够使我们最大限度地实现系统的价值。
 *  虽然标准本身会强加一些限制，
 *  但是它可以促进开放与协作，
 *  并最终提高创造力。
 *
 *  在2009年的PHPTek大会上，多位PHP框架的开发人员组成了PHP互操作性框架制定小组
 *  （PHP-Fig,PHP Framework Interop Group)。
 *  自那以后，开发者逐渐从其他核心组件转移过来，
 *  他们的目的是建立标准、使各自的系统能够更好地共存。
 *
 *                        已通过的PSR
 *
 *   PSR编号                 名称                   说明
 *     1                   基础编码规范           关于PHP标签和基本命名约定等基础的规范
 *     2                   编码风格规范           关于大括号的位置和参数列表等编码格式的规定
 *     3                   日志接口规范           关于日志级别以及记录日志的行为的规定
 *     4                   自动加载规范           关于类和命名空间的命名约定，以及它们与文件系统间映射的规定
 *     6                   缓存接口规范           关于缓存管理的规定，其中包括数据类型、缓存项的生存周期、错误处理等
 *     7                   HTTP消息接口规范       关于HTTP请求和响应的约定
 *
 *
 *  只要遵守自动加载规范以及编码风格规范，
 *  我们就可以编写出与其他开发人员和组件协作的代码。
 *
 *  没有哪一套标准在本质上是优于另一套标准。
 *
 *  标准是关于人与软件的协作，这样的选择也可以算是标准的一部分。
 *
 *
 *
 *  bike-shed 指的是一些评论家倾向于关注项目中不重要的元素。
 *  它讽刺的是，之所以评论家关注这些元素，是因为他们只具备这样的能力。
 *
 *  遵循同一种编码风格有助于提高代码质量。
 *  这主要是提高代码可读性的问题（与规则为什么这样无关）。
 *
 *
 *
 *
 *
 *
 */
